{
    "title_bar": {
        "about": {
            "en": "about",
            "de": "über"
        },
        "experience": {
            "en": "experience",
            "de": "erfahrung"
        },
        "projects": {
            "en": "projects",
            "de": "projekte"
        }
    },
    "home": {
        "greeting": {
            "en": "Hi, I'm Josh",
            "de": "Hallo, ich bin Josh"
        },
        "summary": {
            "en": "cs @ duke | incoming swe @ amazon",
            "de": "informatik @ duke | incoming swe @ amazon"
        },
        "copyright": {
            "en": "Inspired by ",
            "de": "Inspiriert von"
        }
    },
    "about": {
        "uni": {
            "en": "I am a senior at Duke pursuing a B.S. in Computer Science and a B.A. in German Studies.",
            "de": "Ich bin in meinem letzten Jahr an der Duke und mache einen B.S. in Informatik und einen B.A. in Germanistik."
        },
        "hs": {
            "en": "I was born and raised in Greenville, SC and graduated from our state's unique public residential STEM school, SCGSSM.",
            "de": "Ich bin in South Carolina geboren und aufgewachsen. Ich war zum ersten mal im Ausland um ein Auslandstudium in Berlin zu machen."
        },
        "fun_fact": {
            "en": "After graduation, I will be moving to NYC to join Amazon as an SDE.",
            "de": "Nach meinem Abschluss ziehe ich nach NYC um bei Amazon als SDE zu arbeiten."
        }
    },
    "experience": {
        "nersc": {
            "en": "I developed open source Jupyter extensions at NERSC to make supercomputing more user friendly.",
            "de": "Ich habe bei NERSC Jupyter-Erweiterungen entwickelt, um Supercomputing einfacher zu machen."
        },
        "mealme": {
            "en": "I improved customer support tools at MealMe, a startup building the new search engine for food.",
            "de": "Ich habe bei MealMe dabei geholfen, die neue Suchmaschine für Lebensmittel zu erstellen."
        },
        "berkeley": {
            "en": "I added new data analysis modules and features to a scientific data pipeline at Berkeley National Lab.",
            "de": "Ich habe neue Module und Funktionen zu einer Datenpipeline beim Berkeley National Lab hinzugefügt."
        },
        "jpl": {
            "en": "I'm currently developing hardware-software interface tools at NASA JPL to make building spacecraft easier.",
            "de": "Ich entwickle derzeit Interfacetools bei der NASA JPL, um den Bau von Raumfahrzeugen zu vereinfachen."
        },
        "resume": {
            "en": "View my resume <a>here<a> for some more details.",
            "de": "Mein Lebenslauf ist <a>hier<a>, um weiter zu erfahren."
        }
    },
    "projects": {
        "technologies": {
            "en": "Technologies",
            "de": "Technologien"
        },
        "regvue": {
            "en": "I built a register documentation tool at NASA JPL for use in the Europa Clipper and Mars Sample Return missions. This project provides web and desktop applications that can display design description files as a full documentation site with advanced search, bit encoding/decoding, and bit diffing features.",
            "de": "Ich entwickelte ein Registerdokumentationstool bei NASA JPL zur Verwendung bei der Europa Clipper Mission und Mars Sample Return Mission auf. Dieses Projekt stellt Web- und Desktop-Anwendungen bereit, die Design-Beschreibungsdateien als vollständige Dokumentationsseite mit Such-, Bit-Codierungs-/Decodierungs- und Bit-Diffing-Funktionen anzeigen können."
        },
        "group_duke": {
            "en": "I created a full-stack web app to help Duke students find course GroupMe chats. I built a reactive, multi-page frontend with SvelteKit and used Fiber, an Express-inspired framework for Go, to implement automatic email registration, user auth, and firebase integration.",
            "de": "Ich habe eine Full-Stack-Web-App erstellt, um Duke-Studenten dabei zu helfen, Kurs-GroupMe-Chats zu finden. Ich habe mit SvelteKit ein reaktives, mehrseitiges Frontend erstellt und Fiber, ein von Express inspiriertes Framework für Go, verwendet, um die automatische E-Mail-Registrierung, Benutzerauthentifizierung und Firebase-Integration zu implementieren."
        },
        "entrypoint": {
            "en": "I prototyped a full-stack extension service for JupyterHub that enables launching Jupyter notebooks in virtual environments or containers. This service is currently in use on NERSC's Perlmutter supercomputer, the 5th most powerful computer in the world.",
            "de": "Ich habe einen Prototyp eines Full-Stack-Erweiterungsdienstes für JupyterHub entwickelt, der das Starten von Jupyter-Notebooks in virtuellen Umgebungen oder Containern ermöglicht. Dieser Dienst wird derzeit auf dem Perlmutter-Supercomputer von NERSC, dem fünftleistungsstärksten Computer der Welt, verwendet."
        }
    }
}